{
	"itemGroup.vartypes.item_group": "Various Types",
	"item.vartypes.character_sheet": "Character Sheet",
	// Entities
	"entity.vartypes.thrown_block_type": "%s",
	// Status effects
	"effect.vartypes.fatigue": "Fatigue",
	"effect.vartypes.dazzled": "Dazzled",
	"effect.vartypes.anchored": "Anchored",
	"effect.vartypes.stealth": "Stealth",
	// Item tags
	"tag.item.vartypes.silver": "silver",
	"tag.item.vartypes.vegetarian": "vegetarian",
	"tag.item.vartypes.pescetarian": "pescetarian",
	"tag.item.vartypes.carnivore": "carnivore",
	"tag.item.vartypes.fruit": "fruit",
	"tag.item.vartypes.vegetable": "vegetable",
	"tag.item.vartypes.ignores_diet": "ignores_diet",
	// Supertypes
	"type.vartypes.animal": "Animal",
	"type.vartypes.animal.desc": "Animals are abundant and diverse creatures, typically possessed of a blissful state of ignorance that fills their days with idle comfort and joy. But when their stomach grows empty, nature often gifts them with the teeth and claws to rival any blade and sunder any armour. Fortunate indeed then that they need only overcome their neighbour, far less often you, to see their belly filled.",
	"type.vartypes.aduain": "Aduain",
	"type.vartypes.aduain.desc": "Aduain are strange and bizarre creatures, often possessed of physical features or properties that defy natural explanation. No-one is entirely certain where they actually come from, though many are found in the depths, either in the lightless ocean or the deepest darkest caverns. Some unconfirmed reports also describe them living in abundance in the Farthest Realms, and the Fae in particular don't take kindly to them.",
	"type.vartypes.arthropod": "Arthropod",
	"type.vartypes.arthropod.desc": "Though the term specifically refers to a group of exoskeletal invertebrates with many legs, in modern parlance it has instead come to mean any animalistic creature that creates an inconvenience for civilised folk. Unlike Animals, they are almost universally carnivorous, and correspondingly hostile even when sated.",
	"type.vartypes.construct": "Construct",
	"type.vartypes.construct.desc": "Unlike Undead, Constructs are usually made from component materials that were never living to begin with and were made to be animate by magic or other processes. As a result, they are typically extremely durable, though they also often suffer from an inability to restore damage passively. Humans are most familiar with Constructs via the golems that defend Muintir settlements.",
	"type.vartypes.dragon": "Dragon",
	"type.vartypes.dragon.desc": "Creatures of ancient legend, Dragons are frequently reptilian in appearance but their might far belies such a comparison. They are physically imposing, magically potent, and often possessed of airs of superiority as a result. However, their inevitable arrogance often contributes mercifully to their scarcity.",
	"type.vartypes.element": "Element",
	"type.vartypes.element.desc": "When discussing the Elements, two facts are crucial: With enough magic anything can be moved, and magic is in everything. Therefore it is only a matter of density that keeps rocks and water alike beholden to gravity. Elements are what happens when that density not only reaches a critical point, but far exceeds it. Though living, they have precious little in common with most other forms of life, and are often energetic and unstable.",
	"type.vartypes.fae": "Fae",
	"type.vartypes.fae.desc": "The Fae are mischievous creatures from the Emerald Fields, a forgotten dimension as ancient as it is unreachable by Human hands. Orkin legend tells that they first arrived in the Overworld when a mythic hero tore open a portal to the Fields with a magic spear. Though their pranks and jokes can give them the appearance of being untrustworthy or even malevolent, they consider themselves mentors and educators to the shorter-lived races.",
	"type.vartypes.human": "Human",
	"type.vartypes.human.desc": "Humans should generally be the most familiar type of creature to Linn, as it describes everything that is roughly Linn-size and bipedal. Humans exist in relative diversity, and a great many forms are distinguished only in minor details. This includes the Muintir, the Naimhde, and even the Orkin.",
	"type.vartypes.ooze": "Ooze",
	"type.vartypes.ooze.desc": "Oozes are primordial creatures that are so old even the Fae don't know when they first appeared in the world. They are simple creatures, quite literally, as they often appear to be a mass of acidic fluid contained only by a semi-porous membrane. Though this leaves them little room for higher thought, they should be approached with caution, as this lack of reasoning has done nothing to hinder their survival for millennia.",
	"type.vartypes.othall": "Othall",
	"type.vartypes.othall.desc": "Othall, literally meaning ''from over there'', describes creatures who usually originate from a dimension other than the Overworld. Though not many in number in the Overworld, owing to their distant homelands, they are often figures of legend, for good or ill.",
	"type.vartypes.plant": "Plant",
	"type.vartypes.plant.desc": "Plants are the abundant greenery of the natural world. In truth they have a great deal in common with most animals, but are generally less mobile and find their nutrients in other ways. This should not be taken as a definitive, however, as some examples are all too willing to resort to more violent methods to feed their roots.",
	"type.vartypes.undead": "Undead",
	"type.vartypes.undead.desc": "Things that die, are dead. Things that are given life, are alive. These are the immutable binary states flouted by the existence of Undead. Whether by curse, alchemy, or crass magicks, they are once-living things caught part-way between the two conditions. This often leaves them hobbled with new vulnerabilities and fewer measures against them, but also affords them greater durability and resilience.",
	// Subtypes
	"type.vartypes.native": "Native",
	"type.vartypes.native.desc": "Ah the cosy feeling of home",
	"type.vartypes.othakin": "Othakin",
	"type.vartypes.othakin.desc": "You're not from around here are you?",
	"type.vartypes.altered": "Altered",
	"type.vartypes.altered.desc": "You're not quite who... or rather What you used to be...",
	"type.vartypes.air": "Air",
	"type.vartypes.earth": "Earth",
	"type.vartypes.fire": "Fire",
	"type.vartypes.water": "Water",
	"type.vartypes.aquatic": "Aquatic",
	"type.vartypes.aquatic.desc": "Darling it's better, down where it's wetter, take it from me!",
	"type.vartypes.spectral": "Spectral",
	"type.vartypes.dummy": "Dummy",
	// Dummy subtypes
	"subtype.vartypes.goblinoid": "Goblinoid",
	"subtype.vartypes.linn": "Linn",
	"subtype.vartypes.linn.desc": "Us",
	"subtype.vartypes.muintir": "Muintir",
	"subtype.vartypes.muintir.desc": "Translated as ''The People'', these friendly humans are keen farmers, craftsmen, and traders",
	"subtype.vartypes.naimhde": "Naimhde",
	"subtype.vartypes.naimhde.desc": "Not all Muintir are benevolent, and some offshoots have become outright hostile",
	"subtype.vartypes.orkin": "Orkin",
	"subtype.vartypes.orkin.desc": "Though once native to the Overworld, these pig-like peoples have had to learn to survive in far less pleasant realms",
	"subtype.vartypes.reptilian": "Reptilian",
	"subtype.vartypes.verdine": "Verdine",
	// Species
	"species.vartypes.human": "Linn",
	"species.vartypes.human.desc": "Though popularly-believed to be the oldest of the dominant races, this is difficult to verify as they don't record their history much. As a major trading power, they're found almost everywhere.",
	"species.vartypes.orkin": "Orkin",
	"species.vartypes.orkin.desc": "Once native to the Overworld, these porcine folk migrated to the Nether and have since been tested to adapt to its considerable challenges.\nAnd as a culture, they have succeeded.",
	"species.vartypes.merrow": "Merrow",
	"species.vartypes.merrow.desc": "First among the cultures of the sea, virtually unmatched beneath the waves. They are a curious sort who often crave to explore beyond the water's edge. Legends tell of magical hats that might do the trick...",
	"species.vartypes.crioch": "Crioch",
	"species.vartypes.crioch.desc": "Having cast off the oppressive shackles of their Imperial masters long ago, these off-kilter creatures have since become capable couriers and glint-eyed guttersnipes using the same arcane tricks once used against them.",
	"species.vartypes.dragan": "Dragan",
	"species.vartypes.dragan.desc": "A recent entrant to the world stage, these scaled creatures are large and imposing, with a dour and reserved countenance. Their exact origins are unclear, but whispers abound of them worshipping a deity they simply call ''The Queen''...",
	"species.vartypes.verdine": "Verdine",
	"species.vartypes.verdine.desc": "Arriving shortly after the first appearances of the fae in Orkin legend, these sylvan people are said to have fallen from the skies and taken root in the forests.\nThey are aloof and dismissive, but command astonishing economic power through business acumen and agricultural talent.",
	// Templates
	"template.vartypes.insectile": "Insectile",
	"template.vartypes.insectile.desc": "Whether by accident of birth or mutagenic curse, these creatures have chitinous armour plating, segmented eyes, and the capacity to climb sheer surfaces with ease.",
	"template.vartypes.reptilian": "Reptilian",
	"template.vartypes.reptilian.desc": "Most often from communities living along the coast or in swamps, these specimens are adept divers with hardy scaled skin",
	"template.vartypes.aquatic": "Aquatic",
	"template.vartypes.winged": "Winged",
	"template.vartypes.winged.desc": "Frequently believed to be the result of divine blessing, these individuals are born with fully-functional wings",
	"template.vartypes.zombie": "Zombie",
	"template.vartypes.vampire": "Vampire",
	"template.vartypes.siar": "Siar",
	"template.vartypes.dluith": "Dluith",
	"template.vartypes.gravekin": "Gravekin",
	"template.vartypes.gravekin.desc": "By fevered choice or tragic accident, these once-living creatures now have more in common with the residents of graveyards, yet still cling to remnants of their former existence",
	// Template preconditions
	"gui.vartypes.preconditions": "Requirements",
	"precondition.vartypes.is_living": "Must be a living creature",
	"precondition.vartypes.is_physical": "Must have a solid physical form",
	"precondition.vartypes.has_all_of_types": "Must be all of: [%s]",
	"precondition.vartypes.has_any_of_types": "Must be any of: [%s]",
	"precondition.vartypes.has_none_of_types": "Must not be: [%s]",
	// Template operations
	"gui.vartypes.operations": "Effects",
	"operation.vartypes.lose_all_types": "Lose all types",
	"operation.vartypes.lose_supertypes": "Lose all supertypes",
	"operation.vartypes.lose_subtypes": "Lose all subtypes",
	"operation.vartypes.lose_dummy_subtypes": "Lose all flavour subtypes",
	"operation.vartypes.add_types": "Gain [%s]",
	"operation.vartypes.remove_types": "Lose [%s]",
	"operation.vartypes.replace_types": "Replace all [%s] types with [%s]",
	"operation.vartypes.set_types": "Types become %s",
	"operation.vartypes.set_supertypes": "Supertypes become [%s]",
	"operation.vartypes.add_ability": "Gain [%s]",
	"operation.vartypes.remove_ability": "Lose [%s]",
	"operation.vartypes.remove_all_ability": "Lose all [%s] abilities",
	// Actions
	"action.vartypes.eat": "eat",
	"action.vartypes.eat.desc": "Any creature that eats is vulnerable to starvation",
	"action.vartypes.breathe": "breathe",
	"action.vartypes.breathe.desc": "Any creature that breathes is vulnerable to suffocation or drowning, depending on the exact context",
	"action.vartypes.sleep": "sleep",
	"action.vartypes.sleep.desc": "Any creature that sleeps is vulnerable to phantoms but can skip the night",
	"action.vartypes.regen": "regenerate health",
	"action.vartypes.regen.desc": "Any creature that does not regenerate health naturally must find other sources of healing",
	"action.vartypes.can_action": "Can %s",
	"action.vartypes.cannot_action": "Does not %s",
	// Abilities
	"ability.vartypes.breathe_in_fluid": "Breathe in fluid",
	"ability.vartypes.breathe_in_fluid.desc": "You can breathe in [#%s] fluids.",
	"ability.vartypes.breathe_in": "Breathe in %s",
	"ability.vartypes.suffocate_in_fluid": "Suffocate in fluid",
	"ability.vartypes.suffocate_in_fluid.desc": "You cannot breathe in [%s] fluids.",
	"ability.vartypes.suffocate_in": "Suffocate in %s",
	"ability.vartypes.amphibious": "Amphibious",
	"ability.vartypes.amphibious.desc": "You can breathe on dry land as easily as in your natural environment.",
	"ability.vartypes.night_vision": "Night Vision",
	"ability.vartypes.night_vision.desc": "Your eyes are keen and more than able to perceive fine detail even in pitch black conditions.",
	"ability.vartypes.swim": "Swim",
	"ability.vartypes.swim.desc": "You can move nimbly and easily in any liquid.",
	"ability.vartypes.climb": "Climb",
	"ability.vartypes.climb.desc": "You are able to surmount almost any vertical surface with ease.",
	"ability.vartypes.fly": "Fly",
	"ability.vartypes.fly.desc": "You are capable of self-propelled flight through the air, at the cost of a bit of hunger.",
	"ability.vartypes.burrow": "Burrow",
	"ability.vartypes.burrow.desc": "You can move through the ground with ease. You can pass through all [%s] blocks.",
	"ability.vartypes.teleport": "Teleport",
	"ability.vartypes.teleport.desc": "You can teleport to any point you can see within [%s] blocks.",
	"ability.vartypes.ghostly": "Ghostly",
	"ability.vartypes.ghostly.desc": "At a whim, you can become completely intangible.",
	"ability.vartypes.intangible": "Intangible",
	"ability.vartypes.intangible.desc": "You can pass through almost any form of solid matter as though it, or you, weren't there at all.",
	"ability.vartypes.burn_in_sun": "Sunburn",
	"ability.vartypes.burn_in_sun.desc": "You immediately start to sizzle when exposed to sunlight, unless wearing proper head protection.",
	"ability.vartypes.mithridatic": "Mithraditic",
	"ability.vartypes.mithridatic.desc": "You are unphased even by the strongest of toxins. You cannot be affected by [%s] status effects.",
	"ability.vartypes.regeneration": "Regeneration",
	"ability.vartypes.natural_armour": "Natural Armour",
	"ability.vartypes.natural_armour.desc": "Your skin is rugged and durable, affording you [%s] armour points",
	"ability.vartypes.bonus_health.bonus": "Health Bonus",
	"ability.vartypes.bonus_health.bonus.desc": "You have greater physical fortitude than most Linn, granting you [%s] extra health.",
	"ability.vartypes.bonus_health.penalty": "Health Penalty",
	"ability.vartypes.bonus_health.penalty.desc": "You are more frail than the typical Linn, reducing your max health by [%s].",
	"ability.vartypes.deep_breath": "Deep Breath",
	"ability.vartypes.deep_breath.desc": "You can hold your breath twice as long as others",
	"ability.vartypes.mending": "Mending",
	"ability.vartypes.mending.desc": "You are, despite all reason to the contrary, able to regenerate health over time",
	"ability.vartypes.invisibility": "Invisibility",
	"ability.vartypes.invisibility.desc": "You are all but imperceptible to others.",
	"ability.vartypes.run_command": "Run Command",
	"ability.vartypes.run_command.desc": "Runs a predefined command.",
	"ability.vartypes.fast_healing": "Fast Healing",
	"ability.vartypes.fast_healing.desc": "You are able to recover from harm at an accelerated rate, regardless the severity of your injuries. You regain [%s] health every [%s]s whilst having at least [%s] food.",
	"ability.vartypes.pariah": "Pariah",
	"ability.vartypes.pariah.desc": "Your mere presence inspires enmity in some races. All [%s] are hostile to you on sight.",
	"ability.vartypes.goldheart": "Goldheart",
	"ability.vartypes.goldheart.desc": "You share a kinship with those who covet gold.",
	"ability.vartypes.indomitable": "Indomitable",
	"ability.vartypes.indomitable.desc": "Waves and rocks break upon you with ease, your bounding box is as sturdy as the finest boat.",
	"ability.vartypes.water_walking": "Waterstrider",
	"ability.vartypes.water_walking.desc": "Your feet are specially adapted for bouyancy. You can stand atop [%s] as though it were solid ground.",
	"ability.vartypes.ribshot": "Ribshot",
	"ability.vartypes.ribshot.desc": "You can quickly shoot out a bony projectile at your foes. Don't worry, ribs grow back.",
	"ability.vartypes.fireball": "Fireball",
	"ability.vartypes.berserk": "Berserk",
	"ability.vartypes.berserk.desc": "Your rage has kept you alive through dire circumstances. You gain Strength and Absorption for [%s], but are weaker and slower for [%s] afterwards.",
	"ability.vartypes.mindless": "Mindless",
	"ability.vartypes.mindless.desc": "Your mind is long gone, if it ever truly existed. You cannot collect experience and are incapable of using any [%s] menu.",
	"ability.vartypes.omniscient": "Omniscient",
	"ability.vartypes.omniscient.desc": "Your knowledge is boundless. You have no need of experience, because you already have more than can be counted.",
	"ability.vartypes.quake": "Quake",
	"ability.vartypes.quake.desc": "You can use your bulk to rock the ground beneath you. If active when you land from a fall, you emit a shockwave through the earth out to a maximum of [%s] blocks.",
	"ability.vartypes.gelatinous": "Gelatinous",
	"ability.vartypes.gelatinous.desc": "You are chiefly composed of only a handful of extremely large singular cells, rendering you 15% less vulnerable to physical damage. And translucent.",
	"ability.vartypes.thunderstep": "Thunderstep",
	"ability.vartypes.thunderstep.desc_thunder": "You can use lightning itself to travel between your current position and any point [%s] - [%s] blocks away. This ability is only usable during storms.",
	"ability.vartypes.thunderstep.desc_no_thunder": "You can use lightning itself to travel between your current position and any point [%s] - [%s] blocks away.",
	"ability.vartypes.bad_breath": "Bad Breath",
	"ability.vartypes.bad_breath.desc": "You spew out a cloud of vapour reaching out [%s] blocks, conveying [%s], and lingering for [%s]",
	"ability.vartypes.webwalker": "Web Walker",
	"ability.vartypes.webwalker.desc": "Your kind have spent generations living comfortably amongst substances that would severely impede others. Your speed is not affected by any [%s] blocks.",
	"ability.vartypes.herbivore": "Herbivorous",
	"ability.vartypes.herbivore.desc_deny": "Your body cannot process certain foods. You are unable to eat any [%s] item.",
	"ability.vartypes.herbivore.desc_allow": "Your body is specially capable of processing certain foods others may find unpalatable. You can only eat [%s] items.",
	"ability.vartypes.herbivore.desc_both": "Your body is specialised to consume certain foods, to the exclusion of others. You can eat any [%s] item but cannot digest any [%s] item.",
	"ability.vartypes.herbivore.desc": "Your diet seems at a glance to be the same as any omnivore, but something strange is at work behind the scenes...",
	"ability.vartypes.carnivore": "Carnivore",
	"ability.vartypes.flameproof": "Flameproof",
	"ability.vartypes.flameproof.desc": "You are particularly resistent to certain forms of harm. You take [%s] percent less damage from [%s] sources.",
	"ability.vartypes.fleece": "Fleeced",
	"ability.vartypes.fleece.desc": "Your body naturally converts food into a useful byproduct. In exchange for [%s] food, you can generate [%s].",
	"ability.vartypes.home_turf": "Home Turf",
	"ability.vartypes.home_turf.desc_block": "You are especially adapted to your environment. You receive [%s] when your surroundings are at least [%s] percent made of [%s] blocks.",
	"ability.vartypes.home_turf.desc_biome": "You are especially adapted to your environment. You receive [%s] when your surroundings are at least [%s] percent inside of [%s] biomes.",
	"ability.vartypes.home_turf.desc_both": "You are especially adapted to your environment. You receive [%s] when your surroundings are at least [%s] percent made of [%s] blocks inside [%s] biomes.",
	"ability.vartypes.home_turf.desc": "You are especially adapted to your environment. You receive [%s] at all times.",
	"ability.vartypes.oresight": "Oresight",
	"ability.vartypes.oresight.desc": "You are keenly attuned to the presence of certain materials. When activated, identifies all [%s] blocks within a [%s] block radius for [%s].",
	"ability.vartypes.forgetful": "Forgetful",
	"ability.vartypes.forgetful.desc": "Things slip through your memory as easily as they enter it. You can neither pick collect experience nor unlock crafting recipes.",
	"ability.vartypes.photosynth": "Photosynth",
	"ability.vartypes.photosynth.desc": "Whilst stationary, you can restore your vitality by collecting energy from direct sunlight. You recover [%s] hunger and [%s] saturation every [%s] this way.",
	"ability.vartypes.faeskin": "Faeskin",
	"ability.vartypes.faeskin.desc_blocks": "Your skin sizzles when in contact with certain materials. You are penalised for making contact with [%s] blocks.",
	"ability.vartypes.faeskin.desc_items": "Your skin sizzles when in contact with certain materials. You are penalised for making contact with [%s] items.",
	"ability.vartypes.faeskin.desc_both": "Your skin sizzles when in contact with certain materials. You are penalised for making contact with [%s] blocks or [%s] items.",
	"ability.vartypes.faeskin.desc": "Your skin sizzles when in contact with certain materials. At least, you're reasonably sure of that...",
	"ability.vartypes.cosmetic_wings": "Vestigial Wings",
	"ability.vartypes.cosmetic_wings.desc": "Though pretty to look at, these wings are incapable of actually supporting you in flight.",
	"ability.vartypes.scale.increase": "Tall",
	"ability.vartypes.scale.increase.desc": "You are [%s] percent taller than most Linn.",
	"ability.vartypes.scale.decrease": "Short",
	"ability.vartypes.scale.decrease.desc": "You are [%s] percent shorter than most Linn.",
	"ability.vartypes.bonus_damage.bonus": "Brutish",
	"ability.vartypes.bonus_damage.bonus.desc": "You are capable of dishing out more damage than most even with the same weaponry. You deal [%s] more damage with most melee attacks.",
	"ability.vartypes.bonus_damage.penalty": "Weak",
	"ability.vartypes.bonus_damage.penalty.desc": "You are ill-equipped to dish out damage by base musculature alone. You deal [%s] less damage with most melee attacks.",
	"ability.vartypes.flexible.bonus": "Posture",
	"ability.vartypes.flexible.bonus.desc": "You can expand your form to more easily intimidate others. Whilst active, you are [%s] percent taller.",
	"ability.vartypes.flexible.penalty": "Shrink",
	"ability.vartypes.flexible.penalty.desc": "You can squeeze yourself into a smaller shape to pass through tight spaces. Whilst active, you are [%s] percent smaller.",
	"ability.vartypes.sculk_sight": "Sculksight",
	"ability.vartypes.sculk_sight.desc": "You are able to precisely pinpoint the origin of vibrations within [%s] blocks.",
	"ability.vartypes.sunblind": "Sunblind",
	"ability.vartypes.sunblind.desc": "Your physiology is best suited to dim or indoor environments. You suffer from [%s] whilst in direct sunlight.",
	"ability.vartypes.drops": "Drops",
	"ability.vartypes.drops.desc": "Your body contains harvestable goods that others may find useful. On death, you additionally drop [%s].",
	"ability.vartypes.stealth": "Stealth",
	"ability.vartypes.stealth.desc": "You can become temporarily imperceptible, until the moment you strike.",
	"ability.vartypes.flaming_fist": "Flaming Fist",
	"ability.vartypes.flaming_fist.desc": "Your melee attacks are imbued with flame, igniting opponents for [%s] on hit.",
	"ability.vartypes.poison": "Poison",
	"ability.vartypes.poison.desc": "Your melee attacks are infused with toxins, conveying [%s] to your victims.",
	"ability.vartypes.cold_blooded": "Cold Blooded",
	"ability.vartypes.cold_blooded.desc": "You are ill-equipped to tolerate certain climates. You experience [%s] in such biomes.",
	"ability.vartypes.webspinner": "Webspinner",
	"ability.vartypes.webspinner.desc": "You produce a block of [%s] and hurl it where you wish.",
	"ability.vartypes.rend": "Rending",
	"ability.vartypes.rend.desc": "Your vicious claws have a chance to deal an extra [%s] damage to the victim's armour.",
	"ability.vartypes.luddite": "Luddite",
	"ability.vartypes.luddite.desc": "Your strikes wear away at your opponents weaponry, randomly dealing [%s] damage.",
	"ability.vartypes.cosmetics": "Cosmetics",
	"ability.vartypes.cosmetics.desc": "Provides one or more visible cosmetics.",
	// Commands
	"command.vartypes.failed_generic": "Command failed",
	"command.vartypes.failed_list_empty": "Current datapack has no options to display",
	"command.vartypes.failed_unrecognised_species": "Species registry ID unrecognised",
	"command.vartypes.failed_unrecognised_template": "Template registry ID unrecognised",
	"command.vartypes.failed_no_species_selected": "Target has no selected species",
	"command.vartypes.failed_no_templates_applied": "Target has no templates applied",
	"command.vartypes.failed_no_custom_types_applied": "Target has no custom types",
	"command.vartypes.failed_no_dimension_set": "Target has no custom home dimension",
	"command.vartypes.failed_test": "Character sheet test failed",
	"command.vartypes.list.homes.success": "There are %s available dimensions:",
	"command.vartypes.list.species.success": "There are %s available species:",
	"command.vartypes.list.templates.success": "There are %s available templates:",
	"command.vartypes.get.power.success": "%s has power %s",
	"command.vartypes.get.home.success": "%s is from %s",
	"command.vartypes.get.home.success.custom": "%s is from %s (custom)",
	"command.vartypes.get.abilities.success": "%s has %s abilities:",
	"command.vartypes.get.types.success": "%s has the types: %s",
	"command.vartypes.get.species.success": "%s is a %s",
	"command.vartypes.get.templates.success": "%s has %s applied templates",
	"command.vartypes.get.custom_home.success": "%s custom home is %s",
	"command.vartypes.get.custom_types.success": "%s's custom types are: [%s]",
	"command.vartypes.get.custom_abilities.success": "%s has %s custom abilities:",
	"command.vartypes.get.custom_cosmetics.success": "%s has %s custom cosmetics applied",
	"command.vartypes.get.nonlethal.success": "%s currently has %s points of nonlethal damage",
	"command.vartypes.get.cosmetics.success": "%s currently has active %s cosmetics",
	"command.vartypes.custom_home.apply.success": "%s is now from %s",
	"command.vartypes.custom_home.clear.success": "Custom home dimension cleared, %s is now from %s",
	"command.vartypes.custom_home.remove.success": "Custom home dimension removed, %s is now from %s",
	"command.vartypes.custom_types.add.success": "Added %s type to %s",
	"command.vartypes.custom_types.add.failed.present": "%s already has the %s type",
	"command.vartypes.custom_types.remove.failed.missing": "%s already does not have the %s type",
	"command.vartypes.custom_types.remove.success": "Removed %s from %s",
	"command.vartypes.custom_types.remove.all.success": "Removed all custom types from %s",
	"command.vartypes.custom_abilities.add.success": "Added %s ability to %s",
	"command.vartypes.custom_abilities.remove.success": "Removed %s ability from %s",
	"command.vartypes.custom_abilities.remove.failed": "Could not remove %s from %s as they do not have it",
	"command.vartypes.custom_abilities.remove.all.success": "Removed %s custom abilities from %s",
	"command.vartypes.custom_cosmetics.add.success": "Added %s cosmetic to %s",
	"command.vartypes.custom_cosmetics.remove.success": "Removed %s cosmetic from %s",
	"command.vartypes.custom_cosmetics.remove.failed": "Failed to remove %s cosmetic from %s",
	"command.vartypes.custom_cosmetics.remove.all.success": "Cleared %s custom cosmetics from %s",
	"command.vartypes.custom_cosmetics.remove.all.failed": "%s has no custom cosmetics to clear",
	"command.vartypes.custom_cosmetics.remove.tinted.success": "Removed cosmetic from %s",
	"command.vartypes.custom_cosmetics.remove.tinted.failed": "Failed to remove cosmetic from %s",
	"command.vartypes.custom_cosmetics.remove.category.success": "Removed all %s cosmetics from %s",
	"command.vartypes.custom_cosmetics.remove.category.failed": "Failed to remove any %s cosmetics from %s",
	"command.vartypes.template.apply.success": "Applied %s template to %s",
	"command.vartypes.template.apply.failed.present": "%s already has the %s template",
	"command.vartypes.template.apply.failed.invalid": "The %s template is not valid for %s",
	"command.vartypes.template.remove.success": "Removed %s template from %s",
	"command.vartypes.template.remove.failed.missing": "%s does not have the %s template",
	"command.vartypes.template.remove.all.success": "Removed all templates from %s",
	"command.vartypes.species.apply.success": "%s is now a %s",
	"command.vartypes.species.apply.failed": "%s is already a %s",
	"command.vartypes.species.remove.success": "Removed %s species from %s",
	"command.vartypes.species.remove.failed": "%s is already not a %s",
	"command.vartypes.nonlethal.remove.success": "Removed at most %s points of nonlethal damage from %s",
	"command.vartypes.nonlethal.clear.success": "Removed all nonlethal damage from %s",
	"command.vartypes.nonlethal.apply.success": "Applied %s points of nonlethal damage to %s",
	"command.vartypes.nonlethal.set.success": "Set %s's current nonlethal damage to %s",
	"command.vartypes.reset.success": "Reset the character sheet of %s",
	"command.vartypes.randomize.success": "Randomized %s's character sheet",
	"command.vartypes.nonlethal.success": "Applied %s nonlethal damage to %s",
	"command.vartypes.test.success": "Character sheet test passed",
	// Gui
	"gui.vartypes.no_character_sheet": "%s has no character sheet to view",
	"gui.vartypes.typeset": "%s (%s)",
	"gui.vartypes.templates": "%s templates",
	"gui.vartypes.activated_ability.success": "Used [%s]",
	"gui.vartypes.activated_ability.failed": "You can't use %s right now",
	"gui.vartypes.ability_cooldown": "Cooldown: %s",
	"gui.vartypes.hours": "%sh",
	"gui.vartypes.minutes": "%sm",
	"gui.vartypes.seconds": "%ss",
	"gui.vartypes.milliseconds": "%sms",
	"gui.vartypes.ability_passive": "Passive Ability",
	"gui.vartypes.ability_activated": "Activated Ability",
	"gui.vartypes.ability_toggled": "Toggled Ability",
	"gui.vartypes.toggle_on": "%s (Active)",
	"gui.vartypes.toggle_off": "%s (Inactive)",
	"gui.vartypes.creator_confirm": "Confirm",
	"gui.vartypes.creator_preview": "Preview",
	"gui.vartypes.creator_back": "Back",
	"gui.vartypes.creator_species": "Species",
	"gui.vartypes.creator_template": "Templates",
	"gui.vartypes.creator_set_species": "Click to select %s",
	"gui.vartypes.creator_add_template": "Click to add %s",
	"gui.vartypes.creator_remove_template": "Click to remove %s",
	"gui.vartypes.power_value": "Power %s",
	"gui.vartypes.no_abilities_to_activate": "You don't have any abilities to activate",
	"gui.vartypes.no_ability_favourited": "You have no ability assigned to that slot",
	"gui.vartypes.set_favourite": "Left-click to set favourite",
	"gui.vartypes.clear_held_ability": "Click to clear",
	"gui.vartypes.clear_favourite": "Right-click to clear",
	"gui.vartypes.ghostly_turned_on": "You are now %s",
	"gui.vartypes.ghostly_turned_off": "You are no longer %s",
	"gui.vartypes.oresight_tally": "Oresight detected %s blocks",
	"gui.vartypes.faeskin_penalty": "Your hands sting from holding it",
	"gui.vartypes.wing_style": "Style: %s",
	"gui.vartypes.colour": "Colour: %s",
	// Enums
	"wings.vartypes.butterfly": "Butterfly",
	"wings.vartypes.dragonfly": "Dragonfly",
	"wings.vartypes.beetle": "Beetle",
	"wings.vartypes.bat": "Bat",
	"wings.vartypes.bird": "Bird",
	"wings.vartypes.elytra": "Elytra",
	"wings.vartypes.none": "None",
	// Keybinds
	"category.vartypes.keybindings": "Various Types",
	"key.vartypes.open_abilities": "Open ability menu",
	"key.vartypes.use_fav_ability_1": "Activate favourited ability 1",
	"key.vartypes.use_fav_ability_2": "Activate favourited ability 2",
	"key.vartypes.use_fav_ability_3": "Activate favourited ability 3",
	"key.vartypes.use_fav_ability_4": "Activate favourited ability 4",
	// Loot bags
	"loot.vartypes.table": "Random Loot",
	"loot.vartypes.empty": "Nothing"
}